import sqlite3 as sq
import pickle

with sq.connect('decanat.db') as con:
    
    faculty_list = [
        (1, 'Факультет Информационных Технологий'),
        (2, 'Факультет Робототехники и Мехатроники'),
        (3, 'Факультет Энергетики и Энергомашиностроения'),
        (4, 'Факультет Нанотехнологий и Материаловедения'),
        (5, 'Факультет Авиационной и Космической Техники'), 
        (6, 'Факультет Прикладной Математики и Информатики'),
        (7, 'Факультет Биотехнологии и Биоинженерии'),
        (8, 'Факультет Электроники и Наноэлектроники'),
        (9, 'Факультет Гражданского и Промышленного Строительства'),
        (10, 'Факультет Транспортных Технологий и Систем'),
        
    ]
    
    con.execute(f"""
            --sql
            delete from faculty
            --endsql
                
        """)
    
    faculty_data = con.execute(f"""
            --sql
            select *
            from faculty
            --endsql
                
        """).fetchall()
    
    if not faculty_data:
        for faculty_name_ in faculty_list:
            con.execute(f"""
                --sql
                INSERT INTO faculty VALUES {faculty_name_}
                
                --endsql
                    
            """)
    
    
    
    
    
    departments_list = [
        (1, 'Кафедра Компьютерных Систем и Сетей', 1),
        (2, 'Кафедра Программной Инженерии', 1),
        (3, 'Искусственного Интеллекта и Машинного Обучения', 1),
        (4, 'Кафедра Робототехники', 2),
        (5, 'Кафедра Мехатроники и Автоматизации', 2),
        (6, 'Кафедра Интеллектуальных Транспортных Систем', 2),
        (7, 'Кафедра Теплоэнергетики', 3),
        (8, 'Кафедра Электроэнергетики', 3),
        (9, 'Кафедра Ядерной Энергетики', 3),
        (10, 'Кафедра Наноматериалов', 4),
        (11, 'Кафедра Материаловедения', 4),
        (12, 'Кафедра Наноэлектроники', 4),
        (13, 'Кафедра Авиационной Техники', 5),
        (14, 'Кафедра Космической Техники', 5),
        (15, 'Кафедра Аэрокосмической Безопасности', 5),
        (16, 'Кафедра Вычислительной Математики', 6),
        (17, 'Кафедра Теоретической Информатики', 6),
        (18, 'Кафедра Прикладной Информатики', 6),
        (19, 'Кафедра Биотехнологии', 7),
        (20, 'Кафедра Биомедицинской Инженерии', 7),
        (21, 'Кафедра Экологической Биотехнологии', 7),
        (22, 'Кафедра Электронных Устройств', 8),
        (23, 'Кафедра Системного Проектирования', 8),
        (24, 'Кафедра Телекоммуникаций', 8),
        (25, 'Кафедра Гражданского Строительства', 9),
        (26, 'Кафедра Промышленного и Гидротехнического Строительства', 9),
        (27, 'Кафедра Строительной Экономики и Управления', 9),
        (28, 'Кафедра Железнодорожного Транспорта', 10),
        (29, 'Кафедра Автомобильного Транспорта', 10),
        (30, 'Кафедра Морского и Речного Транспорта', 10)

    ]
    
    con.execute(f"""
            --sql
            delete from departments
            --endsql
                
        """)
    
    departments_data = con.execute(f"""
            --sql
            select *
            from departments
            
            --endsql
                
        """).fetchall()
    if not departments_data:
        for departments_name in departments_list:
            con.execute(f"""
                --sql
                INSERT INTO departments VALUES {departments_name}
                --endsql     
            """)
    
    
    
    specialties_list = [
        (1, 'Архитектура вычислительных систем', 1),
        (2, 'Информатика и вычислительная техника', 1),
        (3, 'Программная инженерия', 1),
        (4, 'Математика и информатика', 2),
        (5, 'Информационные технологии', 2),
        (6, 'Веб-разработка и интернет-технологии', 2),
        (7, 'Физика и информатика', 3),
        (8, 'Машинное обучение и анализ данных', 3),
        (9, 'Когнитивные вычисления', 3),
        (10, 'Проектирование роботизированных систем', 4),
        (11, 'Управление роботами', 4),
        (12, 'Беспилотные авиационные системы', 4),
        (13, 'Мехатронные системы', 5),
        (14, 'Автоматизация технологических процессов', 5),
        (15, 'Промышленная автоматика', 5),
        (16, 'Интеллектуальные транспортные системы', 6),
        (17, 'Системы управления движением', 6),
        (18, 'Безопасность и надежность транспортных систем', 6),
        (19, 'Теплоэнергетические установки', 7),
        (20, 'Альтернативные источники энергии', 7),
        (21, 'Энергосбережение', 7),
        (22, 'Электростанции и подстанции', 8),
        (23, 'Электроснабжение', 8),
        (24, 'Высоковольтная электротехника', 8),
        (25, 'Ядерные реакторы и материалы', 9),
        (26, 'Радиационная безопасность', 9),
        (27, 'Управление ядерными отходами', 9),
        (28, 'Наноматериалы и наноструктуры', 10),
        (29, 'Нанотехнологии в электронике', 10),
        (30, 'Биомедицинская нанотехнология', 10),
        (31, 'Физика и химия материалов', 11),
        (32, 'Технология материалов', 11),
        (33, 'Металлургия и литейное производство', 11),
        (34, 'Наноэлектронные устройства', 12),
        (35, 'Нанофотоника', 12),
        (36, 'Квантовая электроника', 12),
        (37, 'Проектирование и эксплуатация воздушных судов', 13),
        (38, 'Авиационные двигатели', 13),
        (39, 'Системы управления воздушным движением', 13),
        (40, 'Конструирование и эксплуатация космических аппаратов', 14),
        (41, 'Космические двигатели и тяга', 14),
        (42, 'Системы навигации и контроля в космосе', 14),
        (43, 'Безопасность полетов', 15),
        (44, 'Авиационная медицина и психология', 15),
        (45, 'Авиационная и космическая экология', 15),
        (46, 'Математическое моделирование', 16),
        (47, 'Численные методы', 16),
        (48, 'Вычислительные системы и сети', 16),
        (49, 'Алгоритмы и структуры данных', 17),
        (50, 'Теория сложности вычислений', 17),
        (51, 'Теория сложности вычислений', 17),
        (52, 'Информационные системы и технологии', 18),
        (53, 'Прикладное программирование', 18),
        (54, 'Интернет вещей (IoT)', 18),
        (55, 'Промышленная биотехнология', 19),
        (56, 'Молекулярная биология и генетика', 19),
        (57, 'Биоинформатика', 19),
        (58, 'Медицинские приборы и системы', 20),
        (59, 'Биоматериалы', 20),
        (60, 'Биомедицинская визуализация', 20),
        (61, 'Охрана окружающей среды', 21),
        (62, 'Биоремедиация', 21),
        (63, 'Экологическое нормирование и мониторинг', 21),
        (64, 'Разработка электронных компонентов', 22),
        (65, 'Микро- и наноэлектроника', 22),
        (66, 'Оптоэлектроника', 22),
        (67, 'Системы автоматизированного проектирования', 23),
        (68, 'Интегральные схемы и системы на кристалле', 23),
        (69, 'Виртуальная реальность и дополненная реальность', 23),
        (70, 'Системы и сети связи', 24),
        (71, 'Беспроводные технологии', 24),
        (72, 'Сетевая безопасность', 24),
        (73, 'Проектирование зданий и сооружений', 25),
        (74, 'Строительные материалы и изделия', 25),
        (75, 'Городское строительство и хозяйство', 25),
        (76, 'Промышленные сооружения', 26),
        (77, 'Гидротехнические сооружения', 26),
        (78, 'Теплогидроизоляционные работы', 26),
        (79, 'Управление строительными проектами', 27),
        (80, 'Экономика строительства', 27),
        (81, 'Нормирование и контроль в строительстве', 27),
        (82, 'Эксплуатация и обслуживание железнодорожного транспорта', 28),
        (83, 'Проектирование железнодорожных систем', 28),
        (84, 'Безопасность движения по железной дороге', 28),
        (85, 'Конструкция и эксплуатация автомобилей', 29),
        (86, 'Автомобильные дороги и аэродромы', 29),
        (87, 'Логистика и управление на автотранспорте', 29),
        (88, 'Судостроение и судоремонт', 30),
        (89, 'Эксплуатация морского транспорта', 30),
        (90, 'Портовая инфраструктура и управление морскими перевозками', 30)
    ]
    
    
    con.execute(f"""
            --sql
            delete from specialties
            --endsql
                
        """)
    
    specialties_data = con.execute(f"""
            --sql
            select *
            from specialties
            
            --endsql
                
        """).fetchall()
    if not specialties_data:
        for specialties_name in specialties_list:
            con.execute(f"""
                --sql
                INSERT INTO specialties VALUES {specialties_name}
                
                --endsql
                    
            """)
    
    
    subject_list = [
        'Информационные технологии',
        'Операционные системы и среды',
        'Основы алгоритмизации и программирования',
        'Элементы высшей математики',
        'Основы кибернетики и робототехники',
        'Численные методы',
        'Физкультура',
        'Иностранный язык',
        'Психология общения',
        'Облачные технологии',
        'История',
        'Русский язык',
        'Математика',
        'Программирование',
        'Информатика',
        'Физика'
    ]
    
    con.execute(f"""
            --sql
            delete from subjects
            --endsql
                
        """)
    
    
    subject_data = con.execute(f"""
        --sql
        select *
        from subjects
        --endsql                           
        """).fetchall()
    if not subject_data:
        for i, subject_name_ in enumerate(subject_list):
            con.execute(f"""
                --sql
                INSERT INTO subjects VALUES ({i}, '{subject_name_}')
                
                --endsql
                    
            """)
            
    subject_methods_list = [
        'Дифференцированный зачет',
        'Экзамен',
        'Зачет',
        'Недифференцированный зачет',
        'Курсовая работа',
        'Коллоквиум',
        'Контрольная работа'
    ]
    
    
    con.execute(f"""
            --sql
            delete from subject_methods
            --endsql
                
        """)
    
    subject_methods_data = con.execute(f"""
        --sql
        select *
        from subject_methods
        --endsql                           
        """).fetchall()
    if not subject_methods_data:
        for i, subject_methods_name_ in enumerate(subject_methods_list):
            con.execute(f"""
                --sql
                INSERT INTO subject_methods VALUES ({i}, '{subject_methods_name_}')
                --endsql
                    
            """)
            
            
    study_program_list = (
        # id, id_specialties, id_subject, id_stubject_method, lecture_hours, pract_hours, lab_hours, Course work
        (0, 48, 1, 0, 30, 30, 0, True),
        (1, 85, 2, 0, 60, 0, 0, False),
        (2, 36, 3,3, 30, 0, 15, False),
        (3, 24, 4, 2, 30, 30, 30, True),
        (4, 20, 5, 1, 60, 30, 0, False),
        (5, 19, 6, 1, 30, 30, 30, True),
        (6, 18, 7, 2, 30, 0, 0, False),
        (7, 5, 8, 0, 60, 60, 0, False),
        (8, 52, 9, 2, 30, 30, 0, False),
        (9, 52, 9, 2, 30, 30, 0, False),
        (10, 73, 5, 2, 30, 30, 0, False),
        (11, 67, 3, 3, 45, 60, 30, False),
        (12, 5, 7, 1, 45, 90, 30, False),
        (13, 29, 10, 1, 60, 30, 45, False),
        (14, 86, 8, 3, 30, 60, 0, False),
        (15, 65, 3, 2, 45, 45, 0, False),
        (16, 31, 10, 1, 60, 30, 45, True),
        (17, 65, 8, 1, 30, 90, 0, False),
        (18, 39, 5, 4, 30, 30, 30, True),
        (19, 37, 5, 3, 30, 90, 45, False),
        (20, 20, 5, 3, 45, 90, 45, False),
        (21, 9, 8, 1, 30, 60, 0, False),
        (22, 76, 10, 1, 90, 90, 30, True),
        (23, 65, 4, 3, 60, 30, 45, True),
        (24, 78, 8, 4, 90, 60, 30, False),
        (25, 64, 1, 4, 60, 30, 0, False),
        (26, 9, 6, 2, 60, 60, 30, True),
        (27, 58, 10, 4, 90, 45, 0, False),
        (28, 31, 10, 2, 90, 60, 0, False),
        (29, 66, 7, 3, 45, 30, 30, False),
        (30, 43, 3, 1, 90, 60, 0, True),
        (31, 78, 2, 4, 30, 30, 30, True),
        (32, 70, 7, 4, 45, 60, 0, True),
        (33, 81, 6, 4, 90, 45, 0, True),
        (34, 8, 3, 3, 90, 45, 45, False),
        (35, 19, 3, 1, 90, 90, 30, True),
        (36, 16, 8, 3, 60, 90, 30, False),
        (37, 81, 8, 3, 90, 90, 0, True),
        (38, 5, 1, 2, 45, 45, 45, False),
        (39, 34, 4, 1, 45, 45, 0, False),
        (40, 47, 7, 4, 45, 90, 45, True),
        (41, 76, 8, 4, 60, 60, 45, True),
        (42, 81, 2, 4, 90, 30, 30, True),
        (43, 66, 7, 3, 90, 30, 30, False),
        (44, 80, 8, 3, 90, 30, 45, True),
        (45, 65, 9, 3, 90, 45, 45, True),
        (46, 44, 9, 3, 45, 30, 0, True),
        (47, 27, 5, 1, 30, 45, 30, True),
        (48, 44, 9, 1, 90, 60, 0, False),
        (49, 76, 2, 1, 30, 60, 30, True),
        (50, 83, 6, 3, 45, 60, 30, False),
        (51, 4, 12, 0, 30, 30, 30, False),
        (52, 3, 13, 0, 30, 30, 30, False),
        (53, 5, 14, 0, 30, 30, 30, False),
        (54, 7, 15, 1, 45,45,45, True)
        
    )
    
    con.execute(f"""
            --sql
            delete from study_program
            --endsql
                
        """)
    
    
    study_program_data = con.execute(f"""
        --sql
        select *
        from study_program
        --endsql                           
        """).fetchall()
    
    if not study_program_data:
        for i, study_program_name_ in enumerate(study_program_list):
            value_ = (i,) + study_program_name_
            con.execute(f"""
                --sql
                INSERT INTO study_program VALUES {study_program_name_}
                --endsql
                    
            """)
        
    
    
    with open('students.pickle', 'rb') as file:
        student_list = pickle.load(file)
        
    con.execute(f"""
            --sql
            delete from students
            --endsql
                
        """)
    student_info_data = con.execute(f"""
        --sql
        select *
        from students
        --endsql                           
        """).fetchall()
    if not student_info_data:
        for i, student_info in enumerate(student_list):
            value_ = (str(i + 1),) + student_info
            con.execute(f"""
                --sql
                INSERT INTO students VALUES {value_}
                
                --endsql
                    
            """) 
            
    
    with open('s_card.pickle', 'rb') as file:
        study_card_list = pickle.load(file)
    
    
    con.execute(f"""
            --sql
            delete from study_card
            --endsql
                
        """)
    
    
    temp = con.execute(f"""
                --sql
                select id, student_specialty
                from students
                --endsql
                
                """).fetchall()
    students_spec = {}
    
    for elem in temp:
        students_spec[elem[0]] = elem[1]
        
        
    
    study_final = []
    for elem in study_card_list:
        add = [elem[0], 
               elem[1], 
               students_spec[elem[1]],
               elem[2],
               elem[3],
               elem[4]]
        
        
        study_final.append(add)
        
    
    study_card_data = con.execute(f"""
        --sql
        select *
        from study_card
        --endsql                           
        """).fetchall()
    
    if not study_card_data:
        for i, card in enumerate(study_final):
            j = i
            value_ = tuple(card)
            con.execute(f"""
                --sql
                INSERT INTO study_card VALUES {value_}
                
                --endsql
                    
            """) 
    # add Иван с предметом математика
    con.execute(f"""
                --sql
                INSERT INTO study_card VALUES {(j + 2,8252,70,12,1,3)}
                
                --endsql
                """)
    
    
